; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-1-3-270)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p2-3 - location
	p5-0 - location
	p5-2 - location
	p4-3 - location
	p4-5 - location
	p0-1 - location
	p0-4 - location
	p6-0 - location
	p6-2 - location
	p6-3 - location
	p1-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s6)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s3)
	(at package2 s4)
	(at package3 s6)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 23)
	(= (time-to-walk p2-3 s2) 23)
	(= (time-to-walk s3 p2-3) 21)
	(= (time-to-walk p2-3 s3) 21)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 54)
	(= (time-to-walk p5-0 s5) 54)
	(= (time-to-walk s0 p5-0) 93)
	(= (time-to-walk p5-0 s0) 93)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 27)
	(= (time-to-walk p5-2 s5) 27)
	(= (time-to-walk s2 p5-2) 61)
	(= (time-to-walk p5-2 s2) 61)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 72)
	(= (time-to-walk p4-3 s4) 72)
	(= (time-to-walk s3 p4-3) 21)
	(= (time-to-walk p4-3 s3) 21)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 7)
	(= (time-to-walk p4-5 s4) 7)
	(= (time-to-walk s5 p4-5) 83)
	(= (time-to-walk p4-5 s5) 83)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 6)
	(= (time-to-walk p0-1 s0) 6)
	(= (time-to-walk s1 p0-1) 73)
	(= (time-to-walk p0-1 s1) 73)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 51)
	(= (time-to-walk p0-4 s0) 51)
	(= (time-to-walk s4 p0-4) 5)
	(= (time-to-walk p0-4 s4) 5)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 93)
	(= (time-to-walk p6-0 s6) 93)
	(= (time-to-walk s0 p6-0) 17)
	(= (time-to-walk p6-0 s0) 17)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 82)
	(= (time-to-walk p6-2 s6) 82)
	(= (time-to-walk s2 p6-2) 29)
	(= (time-to-walk p6-2 s2) 29)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 25)
	(= (time-to-walk p6-3 s6) 25)
	(= (time-to-walk s3 p6-3) 9)
	(= (time-to-walk p6-3 s3) 9)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 17)
	(= (time-to-walk p1-4 s1) 17)
	(= (time-to-walk s4 p1-4) 21)
	(= (time-to-walk p1-4 s4) 21)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 25)
	(= (time-to-drive s0 s4) 25)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 55)
	(= (time-to-drive s3 s2) 55)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 19)
	(= (time-to-drive s4 s2) 19)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 23)
	(= (time-to-drive s5 s2) 23)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 91)
	(= (time-to-drive s6 s2) 91)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 49)
	(= (time-to-drive s1 s3) 49)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 64)
	(= (time-to-drive s6 s3) 64)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 39)
	(= (time-to-drive s0 s5) 39)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 46)
	(= (time-to-drive s3 s5) 46)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 74)
	(= (time-to-drive s4 s5) 74)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 54)
	(= (time-to-drive s6 s5) 54)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 57)
	(= (time-to-drive s1 s6) 57)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 45)
	(= (time-to-drive s0 s1) 45)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 88)
	(= (time-to-drive s4 s1) 88)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s1)
	(at truck1 s3)
	(at package2 s2)
	(at package3 s5)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver2 s6 p6-3)
   deleted: (at driver2 s6)
   added: (at driver2 p6-3)
   goals met: 1 of 5
2. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   goals met: 1 of 5
3. (walk driver2 p6-3 s3)
   deleted: (at driver2 p6-3)
   added: (at driver2 s3)
   goals met: 1 of 5
4. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 5
5. (drive-truck truck1 s3 s2 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 0 to 550
   goals met: 0 of 5
6. (drive-truck truck1 s2 s4 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 550 to 740
   goals met: 0 of 5
7. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 0 of 5
8. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 740 to 949
   goals met: 0 of 5
9. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 1 of 5
10. (drive-truck truck1 s2 s3 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 949 to 1499
   goals met: 2 of 5
11. (drive-truck truck1 s3 s1 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 1499 to 1989
   goals met: 1 of 5
12. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 2 of 5
13. (walk driver1 p1-4 s1)
   deleted: (at driver1 p1-4)
   added: (at driver1 s1)
   goals met: 2 of 5
14. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 2 of 5
15. (drive-truck truck1 s1 s6 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (fuel-used) from 1989 to 2559
   goals met: 2 of 5
16. (load-truck package3 truck1 s6)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 5
17. (drive-truck truck1 s6 s5 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 2559 to 3153
   goals met: 2 of 5
18. (unload-truck package3 truck1 s5)
   deleted: (in package3 truck1)
   added: (at package3 s5)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 5
19. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 3153 to 3613
   goals met: 4 of 5
20. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 4 of 5
21. (walk driver1 s3 p4-3)
   deleted: (at driver1 s3)
   added: (at driver1 p4-3)
   goals met: 4 of 5
22. (walk driver1 p4-3 s4)
   deleted: (at driver1 p4-3)
   added: (at driver1 s4)
   goals met: 5 of 5
